[NoCoverage] ConditionalExpression
stock/kerfcut/commit/route.ts:14:7
 export async function POST(request: Request) {
   // 1. Validate Machine License (Expect KerfCut)
   const auth = await validateLicenseRequest(request, 'kerfcut')
-  if ('error' in auth) {
+  if (false) {
     return NextResponse.json({ error: auth.error }, { status: auth.status })
   }

[NoCoverage] ConditionalExpression
stock/kerfcut/commit/route.ts:14:7
 export async function POST(request: Request) {
   // 1. Validate Machine License (Expect KerfCut)
   const auth = await validateLicenseRequest(request, 'kerfcut')
-  if ('error' in auth) {
+  if (true) {
     return NextResponse.json({ error: auth.error }, { status: auth.status })
   }

[NoCoverage] ObjectLiteral
stock/kerfcut/commit/route.ts:15:30
   // 1. Validate Machine License (Expect KerfCut)
   const auth = await validateLicenseRequest(request, 'kerfcut')
   if ('error' in auth) {
-    return NextResponse.json({ error: auth.error }, { status: auth.status })
+    return NextResponse.json({}, { status: auth.status })
   }
 

[NoCoverage] BooleanLiteral
stock/kerfcut/commit/route.ts:25:9
     const body = await request.json()
     const { job_reference, consumed_assets, generated_remnants } = body
 
-    if (!consumed_assets || !Array.isArray(consumed_assets) || consumed_assets.length === 0) {
+    if (consumed_assets || !Array.isArray(consumed_assets) || consumed_assets.length === 0) {
       return NextResponse.json({ error: 'Invalid consumed_assets' }, { status: 400 })
     }

[NoCoverage] ConditionalExpression
stock/kerfcut/commit/route.ts:25:64
     const body = await request.json()
     const { job_reference, consumed_assets, generated_remnants } = body
 
-    if (!consumed_assets || !Array.isArray(consumed_assets) || consumed_assets.length === 0) {
+    if (!consumed_assets || !Array.isArray(consumed_assets) || false) {
       return NextResponse.json({ error: 'Invalid consumed_assets' }, { status: 400 })
     }

[NoCoverage] ObjectLiteral
stock/kerfcut/commit/route.ts:26:32
     const { job_reference, consumed_assets, generated_remnants } = body
 
     if (!consumed_assets || !Array.isArray(consumed_assets) || consumed_assets.length === 0) {
-      return NextResponse.json({ error: 'Invalid consumed_assets' }, { status: 400 })
+      return NextResponse.json({}, { status: 400 })
     }
 

[NoCoverage] ObjectLiteral
stock/kerfcut/commit/route.ts:31:73
 
     // 2. ATOMIC COMMIT VIA RPC
     // Moves all logic (consumption, remnants, events) into a single DB transaction.
-    const { data, error } = await adminClient.rpc('commit_kerfcut_job', {
-      p_workspace_id: workspaceId,
-      p_job_reference: job_reference,
-      p_consumed_assets: consumed_assets,
-      p_generated_remnants: generated_remnants || []
-    })
+    const { data, error } = await adminClient.rpc('commit_kerfcut_job', {})
 
     if (error) {

[NoCoverage] StringLiteral
stock/kerfcut/commit/route.ts:31:51
 
     // 2. ATOMIC COMMIT VIA RPC
     // Moves all logic (consumption, remnants, events) into a single DB transaction.
-    const { data, error } = await adminClient.rpc('commit_kerfcut_job', {
+    const { data, error } = await adminClient.rpc("", {
       p_workspace_id: workspaceId,
       p_job_reference: job_reference,

[NoCoverage] ConditionalExpression
stock/kerfcut/commit/route.ts:35:29
       p_workspace_id: workspaceId,
       p_job_reference: job_reference,
       p_consumed_assets: consumed_assets,
-      p_generated_remnants: generated_remnants || []
+      p_generated_remnants: false
     })
 

[NoCoverage] LogicalOperator
stock/kerfcut/commit/route.ts:35:29
       p_workspace_id: workspaceId,
       p_job_reference: job_reference,
       p_consumed_assets: consumed_assets,
-      p_generated_remnants: generated_remnants || []
+      p_generated_remnants: generated_remnants && []
     })
 

[NoCoverage] BlockStatement
stock/kerfcut/commit/route.ts:39:47
     })
 
     if (error) {
-      if (error.message.includes('CONFLICT')) {
-        return NextResponse.json({
-          status: 'conflict',
-          message: error.message
-        }, { status: 409 })
-      }
+      if (error.message.includes('CONFLICT')) {}
       throw error
     }

[NoCoverage] ConditionalExpression
stock/kerfcut/commit/route.ts:39:11
     })
 
     if (error) {
-      if (error.message.includes('CONFLICT')) {
+      if (false) {
         return NextResponse.json({
           status: 'conflict',

[NoCoverage] BlockStatement
stock/kerfcut/commit/route.ts:50:28
 
     return NextResponse.json(data)
 
-  } catch (error: unknown) {
-    console.error('Commit error:', error)
-    const message = error instanceof Error ? error.message : 'Internal Server Error'
-    return NextResponse.json({ error: message }, { status: 500 })
-  }
+  } catch (error: unknown) {}
 }
 

[NoCoverage] ObjectLiteral
stock/kerfcut/commit/route.ts:53:50
   } catch (error: unknown) {
     console.error('Commit error:', error)
     const message = error instanceof Error ? error.message : 'Internal Server Error'
-    return NextResponse.json({ error: message }, { status: 500 })
+    return NextResponse.json({ error: message }, {})
   }
 }
