[NoCoverage] ObjectLiteral
v1/licenses/verify/route.ts:7:31
 import crypto from 'crypto'
 import { getRateLimit } from '@/utils/rate-limit'
 
-const VerifySchema = z.object({
-  cdkey: z.string().min(1, 'Missing cdkey'),
-  machine_id: z.string().min(1, 'Missing machine_id'),
-  app_version: z.string().optional(),
-  os_info: z.string().optional()
-})
+const VerifySchema = z.object({})
 
 const LEASE_DURATION_HOURS = 48

[NoCoverage] MethodExpression
v1/licenses/verify/route.ts:8:10
 import { getRateLimit } from '@/utils/rate-limit'
 
 const VerifySchema = z.object({
-  cdkey: z.string().min(1, 'Missing cdkey'),
+  cdkey: z.string().max(1, 'Missing cdkey'),
   machine_id: z.string().min(1, 'Missing machine_id'),
   app_version: z.string().optional(),

[NoCoverage] StringLiteral
v1/licenses/verify/route.ts:8:28
 import { getRateLimit } from '@/utils/rate-limit'
 
 const VerifySchema = z.object({
-  cdkey: z.string().min(1, 'Missing cdkey'),
+  cdkey: z.string().min(1, ""),
   machine_id: z.string().min(1, 'Missing machine_id'),
   app_version: z.string().optional(),

[NoCoverage] MethodExpression
v1/licenses/verify/route.ts:9:15
 
 const VerifySchema = z.object({
   cdkey: z.string().min(1, 'Missing cdkey'),
-  machine_id: z.string().min(1, 'Missing machine_id'),
+  machine_id: z.string().max(1, 'Missing machine_id'),
   app_version: z.string().optional(),
   os_info: z.string().optional()

[NoCoverage] StringLiteral
v1/licenses/verify/route.ts:9:33
 
 const VerifySchema = z.object({
   cdkey: z.string().min(1, 'Missing cdkey'),
-  machine_id: z.string().min(1, 'Missing machine_id'),
+  machine_id: z.string().min(1, ""),
   app_version: z.string().optional(),
   os_info: z.string().optional()

[NoCoverage] BlockStatement
v1/licenses/verify/route.ts:21:26
     const body = await request.json()
     const result = VerifySchema.safeParse(body)
 
-    if (!result.success) {
-      return NextResponse.json({ error: result.error.issues[0].message }, { status: 400 })
-    }
+    if (!result.success) {}
 
     const { cdkey, machine_id, app_version, os_info } = result.data

[NoCoverage] ConditionalExpression
v1/licenses/verify/route.ts:26:23
     }
 
     const { cdkey, machine_id, app_version, os_info } = result.data
-    const currentIp = request.headers.get('x-forwarded-for')?.split(',')[0] || '127.0.0.1'
+    const currentIp = true
 
     const ratelimit = getRateLimit(10, '1 m') // 10 requests per minute

[NoCoverage] LogicalOperator
v1/licenses/verify/route.ts:26:23
     }
 
     const { cdkey, machine_id, app_version, os_info } = result.data
-    const currentIp = request.headers.get('x-forwarded-for')?.split(',')[0] || '127.0.0.1'
+    const currentIp = request.headers.get('x-forwarded-for')?.split(',')[0] && '127.0.0.1'
 
     const ratelimit = getRateLimit(10, '1 m') // 10 requests per minute

[NoCoverage] BlockStatement
v1/licenses/verify/route.ts:29:20
     const currentIp = request.headers.get('x-forwarded-for')?.split(',')[0] || '127.0.0.1'
 
     const ratelimit = getRateLimit(10, '1 m') // 10 requests per minute
-    if (ratelimit) {
-      const { success } = await ratelimit.limit(`verify_${currentIp}`)
-      if (!success) {
-        return NextResponse.json({ error: 'Too many requests' }, { status: 429 })
-      }
-    }
+    if (ratelimit) {}
 
     const adminClient = createAdminClient()

[NoCoverage] ConditionalExpression
v1/licenses/verify/route.ts:29:9
     const currentIp = request.headers.get('x-forwarded-for')?.split(',')[0] || '127.0.0.1'
 
     const ratelimit = getRateLimit(10, '1 m') // 10 requests per minute
-    if (ratelimit) {
+    if (false) {
       const { success } = await ratelimit.limit(`verify_${currentIp}`)
       if (!success) {

[NoCoverage] ConditionalExpression
v1/licenses/verify/route.ts:31:11
     const ratelimit = getRateLimit(10, '1 m') // 10 requests per minute
     if (ratelimit) {
       const { success } = await ratelimit.limit(`verify_${currentIp}`)
-      if (!success) {
+      if (false) {
         return NextResponse.json({ error: 'Too many requests' }, { status: 429 })
       }

[NoCoverage] BlockStatement
v1/licenses/verify/route.ts:31:21
     const ratelimit = getRateLimit(10, '1 m') // 10 requests per minute
     if (ratelimit) {
       const { success } = await ratelimit.limit(`verify_${currentIp}`)
-      if (!success) {
-        return NextResponse.json({ error: 'Too many requests' }, { status: 429 })
-      }
+      if (!success) {}
     }
 

[NoCoverage] ObjectLiteral
v1/licenses/verify/route.ts:32:66
     if (ratelimit) {
       const { success } = await ratelimit.limit(`verify_${currentIp}`)
       if (!success) {
-        return NextResponse.json({ error: 'Too many requests' }, { status: 429 })
+        return NextResponse.json({ error: 'Too many requests' }, {})
       }
     }

[NoCoverage] ConditionalExpression
v1/licenses/verify/route.ts:43:9
       p_cdkey: cdkey
     })
 
-    if (fetchError || !slots || slots.length === 0) {
+    if (false) {
       return NextResponse.json({ error: 'License key not found' }, { status: 404 })
     }

[NoCoverage] ConditionalExpression
v1/licenses/verify/route.ts:43:9
       p_cdkey: cdkey
     })
 
-    if (fetchError || !slots || slots.length === 0) {
+    if (false || slots.length === 0) {
       return NextResponse.json({ error: 'License key not found' }, { status: 404 })
     }

[NoCoverage] ObjectLiteral
v1/licenses/verify/route.ts:44:68
     })
 
     if (fetchError || !slots || slots.length === 0) {
-      return NextResponse.json({ error: 'License key not found' }, { status: 404 })
+      return NextResponse.json({ error: 'License key not found' }, {})
     }
 

[NoCoverage] StringLiteral
v1/licenses/verify/route.ts:44:41
     })
 
     if (fetchError || !slots || slots.length === 0) {
-      return NextResponse.json({ error: 'License key not found' }, { status: 404 })
+      return NextResponse.json({ error: "" }, { status: 404 })
     }
 

[NoCoverage] ConditionalExpression
v1/licenses/verify/route.ts:50:9
     const slot = slots[0]
 
     // 2. Status handling
-    if (slot.status === 'revoked') {
+    if (false) {
       await adminClient.from('audit_logs').insert({
         workspace_id: slot.workspace_id,

[NoCoverage] ConditionalExpression
v1/licenses/verify/route.ts:50:9
     const slot = slots[0]
 
     // 2. Status handling
-    if (slot.status === 'revoked') {
+    if (true) {
       await adminClient.from('audit_logs').insert({
         workspace_id: slot.workspace_id,

[NoCoverage] StringLiteral
v1/licenses/verify/route.ts:53:22
     if (slot.status === 'revoked') {
       await adminClient.from('audit_logs').insert({
         workspace_id: slot.workspace_id,
-        actor_email: 'SYSTEM',
+        actor_email: "",
         action_type: 'activation_failed',
         target_id: slot.id,

[NoCoverage] ObjectLiteral
v1/licenses/verify/route.ts:58:32
         target_id: slot.id,
         description: `Failed activation attempt for revoked key from machine: ${machine_id}`
       })
-      return NextResponse.json({ error: 'License has been revoked', status: 'revoked' }, { status: 403 })
+      return NextResponse.json({}, { status: 403 })
     }
 

[NoCoverage] ObjectLiteral
v1/licenses/verify/route.ts:62:72
     }
 
     // 3. Bind the machine via RPC (handles activation and verification)
-    const { error: bindError } = await adminClient.rpc('bind_machine', {
-      p_cdkey: cdkey,
-      p_machine_id: machine_id,
-      p_app_version: app_version,
-      p_os_info: os_info,
-      p_ip: currentIp
-    })
+    const { error: bindError } = await adminClient.rpc('bind_machine', {})
 
     if (bindError) {

[NoCoverage] BlockStatement
v1/licenses/verify/route.ts:70:20
       p_ip: currentIp
     })
 
-    if (bindError) {
-      if (bindError.message.includes('already bound')) {
-        return NextResponse.json({ error: 'License bound to another machine', status: 'active' }, { status: 403 })
-      }
-      return NextResponse.json({ error: bindError.message }, { status: 500 })
-    }
+    if (bindError) {}
 
     // 4. GENERATE OFFLINE LEASE (The Lease Model)

[NoCoverage] ConditionalExpression
v1/licenses/verify/route.ts:70:9
       p_ip: currentIp
     })
 
-    if (bindError) {
+    if (true) {
       if (bindError.message.includes('already bound')) {
         return NextResponse.json({ error: 'License bound to another machine', status: 'active' }, { status: 403 })

[NoCoverage] BlockStatement
v1/licenses/verify/route.ts:71:56
     })
 
     if (bindError) {
-      if (bindError.message.includes('already bound')) {
-        return NextResponse.json({ error: 'License bound to another machine', status: 'active' }, { status: 403 })
-      }
+      if (bindError.message.includes('already bound')) {}
       return NextResponse.json({ error: bindError.message }, { status: 500 })
     }

[NoCoverage] ConditionalExpression
v1/licenses/verify/route.ts:71:11
     })
 
     if (bindError) {
-      if (bindError.message.includes('already bound')) {
+      if (false) {
         return NextResponse.json({ error: 'License bound to another machine', status: 'active' }, { status: 403 })
       }

[NoCoverage] ObjectLiteral
v1/licenses/verify/route.ts:72:99
 
     if (bindError) {
       if (bindError.message.includes('already bound')) {
-        return NextResponse.json({ error: 'License bound to another machine', status: 'active' }, { status: 403 })
+        return NextResponse.json({ error: 'License bound to another machine', status: 'active' }, {})
       }
       return NextResponse.json({ error: bindError.message }, { status: 500 })

[NoCoverage] StringLiteral
v1/licenses/verify/route.ts:72:87
 
     if (bindError) {
       if (bindError.message.includes('already bound')) {
-        return NextResponse.json({ error: 'License bound to another machine', status: 'active' }, { status: 403 })
+        return NextResponse.json({ error: 'License bound to another machine', status: "" }, { status: 403 })
       }
       return NextResponse.json({ error: bindError.message }, { status: 500 })

[NoCoverage] ArithmeticOperator
v1/licenses/verify/route.ts:78:56
     }
 
     // 4. GENERATE OFFLINE LEASE (The Lease Model)
-    const expiresAt = Math.floor(Date.now() / 1000) + (LEASE_DURATION_HOURS * 3600)
+    const expiresAt = Math.floor(Date.now() / 1000) + (LEASE_DURATION_HOURS / 3600)
     const payload = JSON.stringify({
       sub: slot.id,

[NoCoverage] ArithmeticOperator
v1/licenses/verify/route.ts:78:34
     }
 
     // 4. GENERATE OFFLINE LEASE (The Lease Model)
-    const expiresAt = Math.floor(Date.now() / 1000) + (LEASE_DURATION_HOURS * 3600)
+    const expiresAt = Math.floor(Date.now() * 1000) + (LEASE_DURATION_HOURS * 3600)
     const payload = JSON.stringify({
       sub: slot.id,

[NoCoverage] BlockStatement
v1/licenses/verify/route.ts:87:23
     })
 
     const leaseSecret = process.env.LEASE_SECRET
-    if (!leaseSecret) {
-      console.error('CRITICAL: LEASE_SECRET environment variable is not set')
-      return NextResponse.json({ error: 'System configuration error' }, { status: 500 })
-    }
+    if (!leaseSecret) {}
 
     const base64Payload = Buffer.from(payload).toString('base64url')

[NoCoverage] BooleanLiteral
v1/licenses/verify/route.ts:87:9
     })
 
     const leaseSecret = process.env.LEASE_SECRET
-    if (!leaseSecret) {
+    if (leaseSecret) {
       console.error('CRITICAL: LEASE_SECRET environment variable is not set')
       return NextResponse.json({ error: 'System configuration error' }, { status: 500 })

[NoCoverage] StringLiteral
v1/licenses/verify/route.ts:88:21
 
     const leaseSecret = process.env.LEASE_SECRET
     if (!leaseSecret) {
-      console.error('CRITICAL: LEASE_SECRET environment variable is not set')
+      console.error("")
       return NextResponse.json({ error: 'System configuration error' }, { status: 500 })
     }

[NoCoverage] ObjectLiteral
v1/licenses/verify/route.ts:89:32
     const leaseSecret = process.env.LEASE_SECRET
     if (!leaseSecret) {
       console.error('CRITICAL: LEASE_SECRET environment variable is not set')
-      return NextResponse.json({ error: 'System configuration error' }, { status: 500 })
+      return NextResponse.json({}, { status: 500 })
     }
 

[NoCoverage] EqualityOperator
v1/licenses/verify/route.ts:100:26
 
     const leaseToken = `${base64Payload}.${signature}`
 
-    const isActivation = slot.status === 'waiting'
+    const isActivation = slot.status !== 'waiting'
 
     return NextResponse.json({

[NoCoverage] ConditionalExpression
v1/licenses/verify/route.ts:100:26
 
     const leaseToken = `${base64Payload}.${signature}`
 
-    const isActivation = slot.status === 'waiting'
+    const isActivation = false
 
     return NextResponse.json({

[NoCoverage] ObjectLiteral
v1/licenses/verify/route.ts:102:30
 
     const isActivation = slot.status === 'waiting'
 
-    return NextResponse.json({
-      success: true,
-      status: 'active',
-      bound_machine_id: machine_id,
-      message: isActivation ? 'License activated' : 'License verified',
-      lease: {
-        token: leaseToken,
-        expires_at: new Date(expiresAt * 1000).toISOString(),
-        duration_hours: LEASE_DURATION_HOURS
-      }
-    })
+    return NextResponse.json({})
 
   } catch (err: unknown) {

[NoCoverage] StringLiteral
v1/licenses/verify/route.ts:106:31
       success: true,
       status: 'active',
       bound_machine_id: machine_id,
-      message: isActivation ? 'License activated' : 'License verified',
+      message: isActivation ? "" : 'License verified',
       lease: {
         token: leaseToken,

[NoCoverage] ArithmeticOperator
v1/licenses/verify/route.ts:109:30
       message: isActivation ? 'License activated' : 'License verified',
       lease: {
         token: leaseToken,
-        expires_at: new Date(expiresAt * 1000).toISOString(),
+        expires_at: new Date(expiresAt / 1000).toISOString(),
         duration_hours: LEASE_DURATION_HOURS
       }

[NoCoverage] BlockStatement
v1/licenses/verify/route.ts:114:26
       }
     })
 
-  } catch (err: unknown) {
-    console.error('License verification error:', err)
-    const message = err instanceof Error ? err.message : 'Internal server error'
-    return NextResponse.json({ error: message }, { status: 500 })
-  }
+  } catch (err: unknown) {}
 }
 
