[Killed] BlockStatement
src/services/portal_service.ts:18:137
  */
 export class PortalService {
 
-  static async getUserProfile(supabase: SupabaseClient, userId: string): Promise<{ profile: UserProfile, workspace: Workspace } | null> {
-    const { data, error } = await supabase
-      .from('users')
-      .select('*, workspaces(*)')
-      .eq('id', userId)
-      .single();
-
-    if (error || !data) return null;
-
-    return {
-      profile: mapUserProfileFromDb(data),
-      workspace: mapWorkspaceFromDb(data.workspaces)
-    };
-  }
+  static async getUserProfile(supabase: SupabaseClient, userId: string): Promise<{ profile: UserProfile, workspace: Workspace } | null> {}
 
   static async getLicenses(supabase: SupabaseClient, workspaceId: string): Promise<License[]> {
killedBy: PortalService.getUserProfile returns mapped profile and workspace on success
statusReason: TypeError: Cannot read properties of undefined (reading 'profile')

[Survived] StringLiteral
src/services/portal_service.ts:20:13
 
   static async getUserProfile(supabase: SupabaseClient, userId: string): Promise<{ profile: UserProfile, workspace: Workspace } | null> {
     const { data, error } = await supabase
-      .from('users')
+      .from("")
       .select('*, workspaces(*)')
       .eq('id', userId)

[Survived] StringLiteral
src/services/portal_service.ts:21:15
   static async getUserProfile(supabase: SupabaseClient, userId: string): Promise<{ profile: UserProfile, workspace: Workspace } | null> {
     const { data, error } = await supabase
       .from('users')
-      .select('*, workspaces(*)')
+      .select("")
       .eq('id', userId)
       .single();

[Killed] ConditionalExpression
src/services/portal_service.ts:25:9
       .eq('id', userId)
       .single();
 
-    if (error || !data) return null;
+    if (false) return null;
 
     return {
killedBy: PortalService.getUserProfile returns null on error
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] ConditionalExpression
src/services/portal_service.ts:25:9
       .eq('id', userId)
       .single();
 
-    if (error || !data) return null;
+    if (true) return null;
 
     return {
killedBy: PortalService.getUserProfile returns mapped profile and workspace on success
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/services/portal_service.ts:33:95
     };
   }
 
-  static async getLicenses(supabase: SupabaseClient, workspaceId: string): Promise<License[]> {
-    const { data } = await supabase
-      .from('license_slots')
-      .select('*')
-      .eq('workspace_id', workspaceId)
-      .order('created_at', { ascending: false });
-
-    return (data || []).map(mapLicenseFromDb);
-  }
+  static async getLicenses(supabase: SupabaseClient, workspaceId: string): Promise<License[]> {}
 
   static async getAuditLogs(supabase: SupabaseClient, workspaceId: string, limit: number = 10): Promise<AuditLog[]> {
killedBy: PortalService.getLicenses maps each returned license row
statusReason: TypeError: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Survived] StringLiteral
src/services/portal_service.ts:35:13
 
   static async getLicenses(supabase: SupabaseClient, workspaceId: string): Promise<License[]> {
     const { data } = await supabase
-      .from('license_slots')
+      .from("")
       .select('*')
       .eq('workspace_id', workspaceId)

[Survived] StringLiteral
src/services/portal_service.ts:36:15
   static async getLicenses(supabase: SupabaseClient, workspaceId: string): Promise<License[]> {
     const { data } = await supabase
       .from('license_slots')
-      .select('*')
+      .select("")
       .eq('workspace_id', workspaceId)
       .order('created_at', { ascending: false });

[Survived] StringLiteral
src/services/portal_service.ts:37:11
     const { data } = await supabase
       .from('license_slots')
       .select('*')
-      .eq('workspace_id', workspaceId)
+      .eq("", workspaceId)
       .order('created_at', { ascending: false });
 

[Survived] BooleanLiteral
src/services/portal_service.ts:38:41
       .from('license_slots')
       .select('*')
       .eq('workspace_id', workspaceId)
-      .order('created_at', { ascending: false });
+      .order('created_at', { ascending: true });
 
     return (data || []).map(mapLicenseFromDb);

[Survived] StringLiteral
src/services/portal_service.ts:38:14
       .from('license_slots')
       .select('*')
       .eq('workspace_id', workspaceId)
-      .order('created_at', { ascending: false });
+      .order("", { ascending: false });
 
     return (data || []).map(mapLicenseFromDb);

[Killed] ConditionalExpression
src/services/portal_service.ts:40:13
       .eq('workspace_id', workspaceId)
       .order('created_at', { ascending: false });
 
-    return (data || []).map(mapLicenseFromDb);
+    return (false).map(mapLicenseFromDb);
   }
 
killedBy: PortalService.getLicenses maps each returned license row
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] LogicalOperator
src/services/portal_service.ts:40:13
       .eq('workspace_id', workspaceId)
       .order('created_at', { ascending: false });
 
-    return (data || []).map(mapLicenseFromDb);
+    return (data && []).map(mapLicenseFromDb);
   }
 
killedBy: PortalService.getLicenses maps each returned license row
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[Killed] BlockStatement
src/services/portal_service.ts:43:117
     return (data || []).map(mapLicenseFromDb);
   }
 
-  static async getAuditLogs(supabase: SupabaseClient, workspaceId: string, limit: number = 10): Promise<AuditLog[]> {
-    const { data } = await supabase
-      .from('audit_logs')
-      .select('*')
-      .eq('workspace_id', workspaceId)
-      .order('created_at', { ascending: false })
-      .limit(limit);
-
-    return (data || []).map(mapAuditLogFromDb);
-  }
+  static async getAuditLogs(supabase: SupabaseClient, workspaceId: string, limit: number = 10): Promise<AuditLog[]> {}
 
   static async getUsersCount(supabase: SupabaseClient, workspaceId: string): Promise<number> {
killedBy: PortalService.getAuditLogs maps audit log rows
statusReason: TypeError: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Survived] StringLiteral
src/services/portal_service.ts:45:13
 
   static async getAuditLogs(supabase: SupabaseClient, workspaceId: string, limit: number = 10): Promise<AuditLog[]> {
     const { data } = await supabase
-      .from('audit_logs')
+      .from("")
       .select('*')
       .eq('workspace_id', workspaceId)

[Survived] BooleanLiteral
src/services/portal_service.ts:48:41
       .from('audit_logs')
       .select('*')
       .eq('workspace_id', workspaceId)
-      .order('created_at', { ascending: false })
+      .order('created_at', { ascending: true })
       .limit(limit);
 

[Killed] ConditionalExpression
src/services/portal_service.ts:51:13
       .order('created_at', { ascending: false })
       .limit(limit);
 
-    return (data || []).map(mapAuditLogFromDb);
+    return (false).map(mapAuditLogFromDb);
   }
 
killedBy: PortalService.getAuditLogs maps audit log rows
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] LogicalOperator
src/services/portal_service.ts:51:13
       .order('created_at', { ascending: false })
       .limit(limit);
 
-    return (data || []).map(mapAuditLogFromDb);
+    return (data && []).map(mapAuditLogFromDb);
   }
 
killedBy: PortalService.getAuditLogs maps audit log rows
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] BlockStatement
src/services/portal_service.ts:54:94
     return (data || []).map(mapAuditLogFromDb);
   }
 
-  static async getUsersCount(supabase: SupabaseClient, workspaceId: string): Promise<number> {
-    const { count } = await supabase
-      .from('users')
-      .select('*', { count: 'exact', head: true })
-      .eq('workspace_id', workspaceId);
-
-    return count || 0;
-  }
+  static async getUsersCount(supabase: SupabaseClient, workspaceId: string): Promise<number> {}
 
   static async getWorkspaceUsers(supabase: SupabaseClient, workspaceId: string): Promise<UserProfile[]> {
killedBy: PortalService.getUsersCount returns the count
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7
Received: undefined

[Survived] BooleanLiteral
src/services/portal_service.ts:57:44
   static async getUsersCount(supabase: SupabaseClient, workspaceId: string): Promise<number> {
     const { count } = await supabase
       .from('users')
-      .select('*', { count: 'exact', head: true })
+      .select('*', { count: 'exact', head: false })
       .eq('workspace_id', workspaceId);
 

[Survived] StringLiteral
src/services/portal_service.ts:57:15
   static async getUsersCount(supabase: SupabaseClient, workspaceId: string): Promise<number> {
     const { count } = await supabase
       .from('users')
-      .select('*', { count: 'exact', head: true })
+      .select("", { count: 'exact', head: true })
       .eq('workspace_id', workspaceId);
 

[Killed] BlockStatement
src/services/portal_service.ts:63:105
     return count || 0;
   }
 
-  static async getWorkspaceUsers(supabase: SupabaseClient, workspaceId: string): Promise<UserProfile[]> {
-    const { data, error } = await supabase
-      .rpc('get_workspace_users', { p_workspace_id: workspaceId });
-
-    if (error) {
-      console.error('Error in getWorkspaceUsers:', error);
-      return [];
-    }
-
-    return (data || []).map(mapUserProfileFromDb);
-  }
+  static async getWorkspaceUsers(supabase: SupabaseClient, workspaceId: string): Promise<UserProfile[]> {}
 
   static async logAction(supabase: SupabaseClient, params: {
killedBy: PortalService.getWorkspaceUsers maps rpc results
statusReason: TypeError: expect(received).toHaveLength(expected)

Matcher error: received value must have a length property whose value must be a number

Received has value: undefined

[Killed] BlockStatement
src/services/portal_service.ts:67:16
     const { data, error } = await supabase
       .rpc('get_workspace_users', { p_workspace_id: workspaceId });
 
-    if (error) {
-      console.error('Error in getWorkspaceUsers:', error);
-      return [];
-    }
+    if (error) {}
 
     return (data || []).map(mapUserProfileFromDb);
killedBy: PortalService.getWorkspaceUsers returns an empty array and logs on rpc error
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
src/services/portal_service.ts:68:21
       .rpc('get_workspace_users', { p_workspace_id: workspaceId });
 
     if (error) {
-      console.error('Error in getWorkspaceUsers:', error);
+      console.error("", error);
       return [];
     }

[Killed] LogicalOperator
src/services/portal_service.ts:72:13
       return [];
     }
 
-    return (data || []).map(mapUserProfileFromDb);
+    return (data && []).map(mapUserProfileFromDb);
   }
 
killedBy: PortalService.getWorkspaceUsers maps rpc results
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 0
Received array:  []

[Killed] ConditionalExpression
src/services/portal_service.ts:72:13
       return [];
     }
 
-    return (data || []).map(mapUserProfileFromDb);
+    return (false).map(mapUserProfileFromDb);
   }
 
killedBy: PortalService.getWorkspaceUsers maps rpc results
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] BlockStatement
src/services/portal_service.ts:82:6
     actionType: string,
     targetId?: string,
     description: string
-  }) {
-    // Rule 8.4: Async operations MUST handle error states explicitly
-    try {
-      const { error } = await supabase
-        .from('audit_logs')
-        .insert({
-          workspace_id: params.workspaceId,
-          actor_id: params.actorId,
-          actor_email: params.actorEmail,
-          action_type: params.actionType,
-          target_id: params.targetId,
-          description: params.description
-        });
-
-      if (error) console.error('Failed to log action:', error);
-    } catch (e) {
-      console.error('Critical error in logAction:', e);
-    }
-  }
+  }) {}
 
   static async generateLicense(supabase: SupabaseClient, params: {
killedBy: PortalService.logAction logs an error but does not throw when the insert fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Failed to log action:", {"message": "insert failed"}

Number of calls: 0

[Killed] BlockStatement
src/services/portal_service.ts:84:9
     description: string
   }) {
     // Rule 8.4: Async operations MUST handle error states explicitly
-    try {
-      const { error } = await supabase
-        .from('audit_logs')
-        .insert({
-          workspace_id: params.workspaceId,
-          actor_id: params.actorId,
-          actor_email: params.actorEmail,
-          action_type: params.actionType,
-          target_id: params.targetId,
-          description: params.description
-        });
-
-      if (error) console.error('Failed to log action:', error);
-    } catch (e) {
+    try {} catch (e) {
       console.error('Critical error in logAction:', e);
     }
killedBy: PortalService.logAction logs an error but does not throw when the insert fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Failed to log action:", {"message": "insert failed"}

Number of calls: 0

[Killed] ConditionalExpression
src/services/portal_service.ts:96:11
           description: params.description
         });
 
-      if (error) console.error('Failed to log action:', error);
+      if (true) console.error('Failed to log action:', error);
     } catch (e) {
       console.error('Critical error in logAction:', e);
killedBy: PortalService.logAction succeeds silently when there is no error
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "Failed to log action:", null

[Killed] ConditionalExpression
src/services/portal_service.ts:96:11
           description: params.description
         });
 
-      if (error) console.error('Failed to log action:', error);
+      if (false) console.error('Failed to log action:', error);
     } catch (e) {
       console.error('Critical error in logAction:', e);
killedBy: PortalService.logAction logs an error but does not throw when the insert fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Failed to log action:", {"message": "insert failed"}

Number of calls: 0

[NoCoverage] BlockStatement
src/services/portal_service.ts:97:17
         });
 
       if (error) console.error('Failed to log action:', error);
-    } catch (e) {
-      console.error('Critical error in logAction:', e);
-    }
+    } catch (e) {}
   }
 

[NoCoverage] StringLiteral
src/services/portal_service.ts:98:21
 
       if (error) console.error('Failed to log action:', error);
     } catch (e) {
-      console.error('Critical error in logAction:', e);
+      console.error("", e);
     }
   }

[Killed] BlockStatement
src/services/portal_service.ts:108:24
     cdkey: string | null,
     cdkeyHash: string,
     createdBy: string
-  }): Promise<License> {
-    const { data, error } = await supabase
-      .from('license_slots')
-      .insert({
-        workspace_id: params.workspaceId,
-        app: params.app,
-        cdkey: params.cdkey, // May be null if purging raw keys
-        cdkey_hash: params.cdkeyHash,
-        status: 'waiting',
-        created_by: params.createdBy
-      })
-      .select()
-      .single();
-
-    if (error) throw new Error(`DB_ERROR: ${error.message}`);
-    return mapLicenseFromDb(data);
-  }
+  }): Promise<License> {}
 
   static async updateLicenseLabel(supabase: SupabaseClient, licenseId: string, workspaceId: string, label: string) {
killedBy: PortalService.generateLicense returns the mapped inserted license
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Survived] ObjectLiteral
src/services/portal_service.ts:111:15
   }): Promise<License> {
     const { data, error } = await supabase
       .from('license_slots')
-      .insert({
-        workspace_id: params.workspaceId,
-        app: params.app,
-        cdkey: params.cdkey, // May be null if purging raw keys
-        cdkey_hash: params.cdkeyHash,
-        status: 'waiting',
-        created_by: params.createdBy
-      })
+      .insert({})
       .select()
       .single();

[Survived] StringLiteral
src/services/portal_service.ts:116:17
         app: params.app,
         cdkey: params.cdkey, // May be null if purging raw keys
         cdkey_hash: params.cdkeyHash,
-        status: 'waiting',
+        status: "",
         created_by: params.createdBy
       })

[Killed] ConditionalExpression
src/services/portal_service.ts:122:9
       .select()
       .single();
 
-    if (error) throw new Error(`DB_ERROR: ${error.message}`);
+    if (false) throw new Error(`DB_ERROR: ${error.message}`);
     return mapLicenseFromDb(data);
   }
killedBy: PortalService.generateLicense throws a DB_ERROR when the insert fails
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "DB_ERROR: constraint"
Received message:   "Cannot read properties of null (reading 'id')"

       98 | export function mapLicenseFromDb(db: any): License {
       99 |   return {
    > 100 |     id: db.id,

[Killed] ConditionalExpression
src/services/portal_service.ts:122:9
       .select()
       .single();
 
-    if (error) throw new Error(`DB_ERROR: ${error.message}`);
+    if (true) throw new Error(`DB_ERROR: ${error.message}`);
     return mapLicenseFromDb(data);
   }
killedBy: PortalService.generateLicense returns the mapped inserted license
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
src/services/portal_service.ts:126:116
     return mapLicenseFromDb(data);
   }
 
-  static async updateLicenseLabel(supabase: SupabaseClient, licenseId: string, workspaceId: string, label: string) {
-    const { error } = await supabase
-      .from('license_slots')
-      .update({ label })
-      .eq('id', licenseId)
-      .eq('workspace_id', workspaceId);
-
-    if (error) throw new Error(`DB_ERROR: ${error.message}`);
-  }
+  static async updateLicenseLabel(supabase: SupabaseClient, licenseId: string, workspaceId: string, label: string) {}
 
   static async revokeLicense(supabase: SupabaseClient, licenseId: string, workspaceId: string): Promise<License | null> {
killedBy: PortalService.updateLicenseLabel throws a DB_ERROR when the update fails
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] ObjectLiteral
src/services/portal_service.ts:129:15
   static async updateLicenseLabel(supabase: SupabaseClient, licenseId: string, workspaceId: string, label: string) {
     const { error } = await supabase
       .from('license_slots')
-      .update({ label })
+      .update({})
       .eq('id', licenseId)
       .eq('workspace_id', workspaceId);

[Survived] StringLiteral
src/services/portal_service.ts:131:11
       .from('license_slots')
       .update({ label })
       .eq('id', licenseId)
-      .eq('workspace_id', workspaceId);
+      .eq("", workspaceId);
 
     if (error) throw new Error(`DB_ERROR: ${error.message}`);

[Killed] BlockStatement
src/services/portal_service.ts:136:121
     if (error) throw new Error(`DB_ERROR: ${error.message}`);
   }
 
-  static async revokeLicense(supabase: SupabaseClient, licenseId: string, workspaceId: string): Promise<License | null> {
-    // Fetch info first for the audit log
-    const { data: current } = await supabase
-      .from('license_slots')
-      .select('cdkey')
-      .eq('id', licenseId)
-      .eq('workspace_id', workspaceId)
-      .single();
-
-    const { error } = await supabase
-      .from('license_slots')
-      .update({ status: 'revoked' })
-      .eq('id', licenseId)
-      .eq('workspace_id', workspaceId);
-
-    if (error) throw new Error(`DB_ERROR: ${error.message}`);
-
-    return current ? mapLicenseFromDb(current) : null;
-  }
+  static async revokeLicense(supabase: SupabaseClient, licenseId: string, workspaceId: string): Promise<License | null> {}
 
   static async updateWorkspaceName(supabase: SupabaseClient, workspaceId: string, name: string) {
killedBy: PortalService.revokeLicense fetches the current key then revokes and returns the mapped license
statusReason: TypeError: Cannot read properties of undefined (reading 'cdkey')

[Survived] StringLiteral
src/services/portal_service.ts:140:15
     // Fetch info first for the audit log
     const { data: current } = await supabase
       .from('license_slots')
-      .select('cdkey')
+      .select("")
       .eq('id', licenseId)
       .eq('workspace_id', workspaceId)

[Survived] StringLiteral
src/services/portal_service.ts:141:11
     const { data: current } = await supabase
       .from('license_slots')
       .select('cdkey')
-      .eq('id', licenseId)
+      .eq("", licenseId)
       .eq('workspace_id', workspaceId)
       .single();

[Survived] ObjectLiteral
src/services/portal_service.ts:147:15
 
     const { error } = await supabase
       .from('license_slots')
-      .update({ status: 'revoked' })
+      .update({})
       .eq('id', licenseId)
       .eq('workspace_id', workspaceId);

[Killed] BlockStatement
src/services/portal_service.ts:156:97
     return current ? mapLicenseFromDb(current) : null;
   }
 
-  static async updateWorkspaceName(supabase: SupabaseClient, workspaceId: string, name: string) {
-    const { error } = await supabase
-      .from('workspaces')
-      .update({ name })
-      .eq('id', workspaceId);
-
-    if (error) throw new Error(`DB_ERROR: ${error.message}`);
-  }
+  static async updateWorkspaceName(supabase: SupabaseClient, workspaceId: string, name: string) {}
 
   static async changeUserRole(supabase: SupabaseClient, userId: string, workspaceId: string, newRole: string) {
killedBy: PortalService.updateWorkspaceName throws a DB_ERROR on failure
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] BlockStatement
src/services/portal_service.ts:165:111
     if (error) throw new Error(`DB_ERROR: ${error.message}`);
   }
 
-  static async changeUserRole(supabase: SupabaseClient, userId: string, workspaceId: string, newRole: string) {
-    const { error } = await supabase
-      .from('users')
-      .update({ role: newRole })
-      .eq('id', userId)
-      .eq('workspace_id', workspaceId);
-
-    if (error) throw new Error(`DB_ERROR: ${error.message}`);
-  }
+  static async changeUserRole(supabase: SupabaseClient, userId: string, workspaceId: string, newRole: string) {}
 
   static async getAssets(supabase: SupabaseClient, workspaceId: string): Promise<Asset[]> {
killedBy: PortalService.changeUserRole throws a DB_ERROR on failure
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Survived] StringLiteral
src/services/portal_service.ts:169:11
     const { error } = await supabase
       .from('users')
       .update({ role: newRole })
-      .eq('id', userId)
+      .eq("", userId)
       .eq('workspace_id', workspaceId);
 

[Survived] StringLiteral
src/services/portal_service.ts:170:11
       .from('users')
       .update({ role: newRole })
       .eq('id', userId)
-      .eq('workspace_id', workspaceId);
+      .eq("", workspaceId);
 
     if (error) throw new Error(`DB_ERROR: ${error.message}`);

[Killed] BlockStatement
src/services/portal_service.ts:175:91
     if (error) throw new Error(`DB_ERROR: ${error.message}`);
   }
 
-  static async getAssets(supabase: SupabaseClient, workspaceId: string): Promise<Asset[]> {
-    const { data } = await supabase
-      .from('assets')
-      .select('*, materials(name, thickness), locations(name)')
-      .eq('workspace_id', workspaceId)
-      .order('created_at', { ascending: false });
-
-    return (data || []).map(mapAssetFromDb);
-  }
+  static async getAssets(supabase: SupabaseClient, workspaceId: string): Promise<Asset[]> {}
 
   static async getMaterials(supabase: SupabaseClient, workspaceId: string): Promise<Material[]> {
killedBy: PortalService.getAssets maps assets including joined material/location
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] StringLiteral
src/services/portal_service.ts:179:11
     const { data } = await supabase
       .from('assets')
       .select('*, materials(name, thickness), locations(name)')
-      .eq('workspace_id', workspaceId)
+      .eq("", workspaceId)
       .order('created_at', { ascending: false });
 

[Killed] ConditionalExpression
src/services/portal_service.ts:182:13
       .eq('workspace_id', workspaceId)
       .order('created_at', { ascending: false });
 
-    return (data || []).map(mapAssetFromDb);
+    return (false).map(mapAssetFromDb);
   }
 
killedBy: PortalService.getAssets maps assets including joined material/location
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] LogicalOperator
src/services/portal_service.ts:182:13
       .eq('workspace_id', workspaceId)
       .order('created_at', { ascending: false });
 
-    return (data || []).map(mapAssetFromDb);
+    return (data && []).map(mapAssetFromDb);
   }
 
killedBy: PortalService.getAssets maps assets including joined material/location
statusReason: TypeError: Cannot read properties of undefined (reading 'systemName')

[Killed] BlockStatement
src/services/portal_service.ts:185:97
     return (data || []).map(mapAssetFromDb);
   }
 
-  static async getMaterials(supabase: SupabaseClient, workspaceId: string): Promise<Material[]> {
-    const { data } = await supabase
-      .from('materials')
-      .select('*')
-      .eq('workspace_id', workspaceId)
-      .eq('is_deleted', false)
-      .order('name', { ascending: true });
-
-    return (data || []).map(mapMaterialFromDb);
-  }
+  static async getMaterials(supabase: SupabaseClient, workspaceId: string): Promise<Material[]> {}
 
   static async getLocations(supabase: SupabaseClient, workspaceId: string): Promise<Location[]> {
killedBy: PortalService.getMaterials maps materials
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] StringLiteral
src/services/portal_service.ts:187:13
 
   static async getMaterials(supabase: SupabaseClient, workspaceId: string): Promise<Material[]> {
     const { data } = await supabase
-      .from('materials')
+      .from("")
       .select('*')
       .eq('workspace_id', workspaceId)

[Survived] BooleanLiteral
src/services/portal_service.ts:190:25
       .from('materials')
       .select('*')
       .eq('workspace_id', workspaceId)
-      .eq('is_deleted', false)
+      .eq('is_deleted', true)
       .order('name', { ascending: true });
 

[Survived] BooleanLiteral
src/services/portal_service.ts:191:35
       .select('*')
       .eq('workspace_id', workspaceId)
       .eq('is_deleted', false)
-      .order('name', { ascending: true });
+      .order('name', { ascending: false });
 
     return (data || []).map(mapMaterialFromDb);

[Survived] ObjectLiteral
src/services/portal_service.ts:191:22
       .select('*')
       .eq('workspace_id', workspaceId)
       .eq('is_deleted', false)
-      .order('name', { ascending: true });
+      .order('name', {});
 
     return (data || []).map(mapMaterialFromDb);

[Killed] LogicalOperator
src/services/portal_service.ts:193:13
       .eq('is_deleted', false)
       .order('name', { ascending: true });
 
-    return (data || []).map(mapMaterialFromDb);
+    return (data && []).map(mapMaterialFromDb);
   }
 
killedBy: PortalService.getMaterials maps materials
statusReason: TypeError: Cannot read properties of undefined (reading 'name')

[Killed] ConditionalExpression
src/services/portal_service.ts:193:13
       .eq('is_deleted', false)
       .order('name', { ascending: true });
 
-    return (data || []).map(mapMaterialFromDb);
+    return (true).map(mapMaterialFromDb);
   }
 
killedBy: PortalService.getMaterials maps materials
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function
