[Killed] BlockStatement
src/services/portal_service.ts:196:97
     return (data || []).map(mapMaterialFromDb);
   }
 
-  static async getLocations(supabase: SupabaseClient, workspaceId: string): Promise<Location[]> {
-    const { data } = await supabase
-      .from('locations')
-      .select('*')
-      .eq('workspace_id', workspaceId)
-      .order('depth', { ascending: true })
-      .order('name', { ascending: true });
-
-    return (data || []).map(mapLocationFromDb);
-  }
+  static async getLocations(supabase: SupabaseClient, workspaceId: string): Promise<Location[]> {}
 }
 
killedBy: PortalService.getLocations maps locations
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Survived] StringLiteral
src/services/portal_service.ts:198:13
 
   static async getLocations(supabase: SupabaseClient, workspaceId: string): Promise<Location[]> {
     const { data } = await supabase
-      .from('locations')
+      .from("")
       .select('*')
       .eq('workspace_id', workspaceId)

[Survived] StringLiteral
src/services/portal_service.ts:199:15
   static async getLocations(supabase: SupabaseClient, workspaceId: string): Promise<Location[]> {
     const { data } = await supabase
       .from('locations')
-      .select('*')
+      .select("")
       .eq('workspace_id', workspaceId)
       .order('depth', { ascending: true })

[Survived] BooleanLiteral
src/services/portal_service.ts:201:36
       .from('locations')
       .select('*')
       .eq('workspace_id', workspaceId)
-      .order('depth', { ascending: true })
+      .order('depth', { ascending: false })
       .order('name', { ascending: true });
 

[Survived] BooleanLiteral
src/services/portal_service.ts:202:35
       .select('*')
       .eq('workspace_id', workspaceId)
       .order('depth', { ascending: true })
-      .order('name', { ascending: true });
+      .order('name', { ascending: false });
 
     return (data || []).map(mapLocationFromDb);

[Survived] ObjectLiteral
src/services/portal_service.ts:202:22
       .select('*')
       .eq('workspace_id', workspaceId)
       .order('depth', { ascending: true })
-      .order('name', { ascending: true });
+      .order('name', {});
 
     return (data || []).map(mapLocationFromDb);

[Killed] ConditionalExpression
src/services/portal_service.ts:204:13
       .order('depth', { ascending: true })
       .order('name', { ascending: true });
 
-    return (data || []).map(mapLocationFromDb);
+    return (true).map(mapLocationFromDb);
   }
 }
killedBy: PortalService.getLocations maps locations
statusReason: TypeError: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).map is not a function

[Killed] LogicalOperator
src/services/portal_service.ts:204:13
       .order('depth', { ascending: true })
       .order('name', { ascending: true });
 
-    return (data || []).map(mapLocationFromDb);
+    return (data && []).map(mapLocationFromDb);
   }
 }
killedBy: PortalService.getLocations maps locations
statusReason: TypeError: Cannot read properties of undefined (reading 'name')
